; domain
(define (domain progetto)
    (:requirements :strips :typing :disjunctive-preconditions :negative-preconditions :action-costs :equality)

    (:types
        cell - object
        tile - object
        tile_3 tile_5 tile_6 tile_7 tile_9 tile_a tile_b tile_c tile_d tile_e tile_f - tile
        debt - object
    )

    (:predicates
        ; to structure the cells into a grid
        (is_above ?c1 - cell ?c2 - cell)
        (is_right ?c1 - cell ?c2 - cell)

        ; to know whether a cell has a silver
        (has_silver ?c - cell)

        ; to avoid using the same tile twice
        (used ?t - tile)

        ; to indicate that the agent has a debt
        (has_debt ?d - debt)

        ; to know whether a cell has a tile placed on it
        (has_tile ?c - cell)

        ; to know the type of tile placed on a cell
        (open_left ?c - cell)
        (open_right ?c - cell)
        (open_above ?c - cell)
        (open_below ?c - cell)

        ; to force the agent to only pay the debts at the end
        (started_paying)

    )

    (:functions
        (total-cost)
    )




    ;############################################### TILE 3 ###############################################

    ;  SHAPE:
    ;
    ;  _____
    ; |_____|
    ;

    (:action place_tile_3
        :parameters (?c - cell ?t - tile_3)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))
            
            ; there must be a cell c2 on the left or on the right with an appropriate tile
            (exists (?c2 - cell)
                (or
                    (and
                        ; c2 is on the left and it connects toward its right
                        (is_right ?c ?c2)
                        (open_right ?c2)
                    )
                    (and
                        ; c2 is on the right and it connects toward its left
                        (is_right ?c2 ?c)
                        (open_left ?c2)
                    )   
                )       
            )
        )

        :effect (and
        
            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left and its right
            (open_right ?c)
            (open_left ?c)

            (increase (total-cost) 6)
        )
    )

    

    ;############################################### TILE 5 ###############################################

    ;  SHAPE:  
    ;
    ;    ___
    ;   |  _|
    ;   |_|

    (:action place_tile_5
        :parameters (?c - cell ?t - tile_5)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the right or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    (and
                        ; c2 is on the right and it connects toward its left
                        (is_right ?c2 ?c)
                        (open_left ?c2)  
                    )
                    (and
                        ; c2 is below and it connects toward above
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )
                )
            )
        )

        :effect (and
            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its right and below
            (open_below ?c)
            (open_right ?c)

            (increase (total-cost) 2)       
        )
    )



    ;############################################### TILE 6 ###############################################

    ;  SHAPE:
    ;  
    ;  ___
    ; |_  |
    ;   |_|

    (:action place_tile_6
        :parameters (?c - cell ?t - tile_6)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))
            
            ; there must be a cell c2 on the left or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    (and
                        ; c2 is on the left and it connects toward its right
                        (is_right ?c ?c2)                     
                        (open_right ?c2)
                    )
                    (and
                        ; c2 is below and it connects toward above
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left and below
            (open_below ?c)
            (open_left ?c)

            (increase (total-cost) 2)
        )
    )



    ;############################################### TILE 7 ###############################################

    ;  SHAPE:
    ;
    ;  _____
    ; |_   _|
    ;   |_|

    (:action place_tile_7
        :parameters (?c - cell ?t - tile_7)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the left or on the right or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is on the left and it connects toward its right
                    (and
                        (is_right ?c ?c2)     
                        (open_right ?c2)                     
                    )
                    ; c2 is on the right and it connects toward its left
                    (and
                        (is_right ?c2 ?c)
                        (open_left ?c2)
                    )
                    ; c2 is below and it connects toward above
                    (and
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left, right and below
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            (increase (total-cost) 8)
        )
    )


    
    ;############################################### TILE 9 ###############################################

    ;  SHAPE:
    ;    _
    ;   | |_
    ;   |___|
    ;

    (:action place_tile_9
        :parameters (?c - cell ?t - tile_9)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the right or above with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is on the right and it connects toward its left
                    (and
                        (is_right ?c2 ?c)
                        (open_left ?c2)
                    )
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its right and above
            (open_above ?c)
            (open_right ?c)

            (increase (total-cost) 2)
        )
    )


    
    ;############################################### TILE A ###############################################

    ;  SHAPE:
    ;    _
    ;  _| |
    ; |___|
    ;

    (:action place_tile_a
        :parameters (?c - cell ?t - tile_a)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the left or above with an appropriate tile
            (exists (?c2 - cell)
                
                (or
                    ; c2 is on the left and it connects toward its right
                    (and
                        (is_right ?c ?c2)
                        (open_right ?c2)
                    )
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left and above
            (open_above ?c)
            (open_left ?c)
    
            (increase (total-cost) 2)
        )
    )


    
    ;############################################### TILE B ###############################################

    ;  SHAPE:
    ;    _
    ;  _| |_
    ; |_____|
    ;

    (:action place_tile_b
        :parameters (?c - cell ?t - tile_b)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the left or on the right or above with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is on the left and it connects toward its right
                    (and
                        (is_right ?c ?c2)
                        (open_right ?c2)
                    )
                    ; c2 is on the right and it connects toward its left
                    (and
                        (is_right ?c2 ?c)
                        (open_left ?c2)
                    )
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left, right and above
            (open_left ?c)
            (open_right ?c)
            (open_above ?c)

            (increase (total-cost) 8)
        )
    )


    
    ;############################################### TILE C ###############################################

    ;  SHAPE:
    ;    _
    ;   | |
    ;   | |
    ;   |_|

    (:action place_tile_c
        :parameters (?c - cell ?t - tile_c)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 above or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                    ; c2 is bellw and it connects toward above
                    (and
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )   
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells above and below
            (open_above ?c)
            (open_below ?c)

            (increase (total-cost) 6)
        )
    )


    
    ;############################################### TILE D ###############################################

    ;  SHAPE:
    ;    _
    ;   | |_
    ;   |  _|
    ;   |_|

    (:action place_tile_d
        :parameters (?c - cell ?t - tile_d)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the right or above or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is on the right and it connects toward its left
                    (and
                        (is_right ?c2 ?c)
                        (open_left ?c2)
                    )
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                    ; c2 is below and it connects toward above
                    (and
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its right, above and below
            (open_below ?c)
            (open_above ?c)
            (open_right ?c)

            (increase (total-cost) 8)
        )
    )


    
    ;############################################### TILE E ###############################################

    ;  SHAPE:
    ;    _
    ;  _| |
    ; |_  |
    ;   |_|
    
    (:action place_tile_e
        :parameters (?c - cell ?t - tile_e)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the left or above or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is on the left and it connects toward its right
                    (and
                        (is_right ?c ?c2)
                        (open_right ?c2)
                    )
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                    ; c2 is below and it connects toward above
                    (and
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left, above and below
            (open_left ?c)
            (open_above ?c)
            (open_below ?c)

            (increase (total-cost) 8)               
        )
    )


    
    ;############################################### TILE F ###############################################

    ;  SHAPE:
    ;    _
    ;  _| |_
    ; |_   _|
    ;   |_|

    (:action place_tile_f
        :parameters (?c - cell ?t - tile_f)
        
        :precondition (and

            ; the agent must not have paid any debt yet
            (not (started_paying))

            ; t must not have been used yet
            (not (used ?t))
            
            ; cell c must not have a tile on it
            (not (has_tile ?c))

            ; there must be a cell c2 on the left or on the right or above or below with an appropriate tile
            (exists (?c2 - cell)
                (or
                    ; c2 is on the left and it connects toward its right
                    (and
                        (is_right ?c ?c2)
                        (open_right ?c2)
                    )
                    ; c2 is on the right and it connects toward its left
                    (and
                        (is_right ?c2 ?c)
                        (open_left ?c2)
                    )
                    ; c2 is above and it connects toward below
                    (and
                        (is_above ?c2 ?c)
                        (open_below ?c2)
                    )
                    ; c2 is below and it connects toward above
                    (and
                        (is_above ?c ?c2)
                        (open_above ?c2)
                    )                            
                )
            )
        )

        :effect (and

            ; cell c has tile t, that is not available anymore
            (has_tile ?c)
            (used ?t)

            ; cell c can connect with cells to its left, right, above and below
            (open_above ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            (increase (total-cost) 15)
        )
    )



    ;############################################### OTHER ###############################################


    (:action take_silver
        :parameters (?c - cell ?d - debt)
        
        :precondition (and
            ; cell c must have the silver
            (has_silver ?c)

            ; cell c must already have a tile on it
            (has_tile ?c)

            ; the agent must have debt d
            (has_debt ?d)
        )

        :effect (and
            ; cell c doesn't have a silver anymore
            (not (has_silver ?c))

            ; the agent doesn't have debt d anymore
            (not (has_debt ?d))
            
            ; the agent has started paying the debts
            (started_paying)
        )
    )



    (:action pay_debt
        :parameters (?d - debt)
        
        :precondition (and
            ; the agent must have debt d
            (has_debt ?d)
        )

        :effect (and
            ; the agent doesn't have debt d anymore
            (not (has_debt ?d))

            ; the agent has started paying the debts
            (started_paying)
              
            (increase (total-cost) 15)
        )
    )
)

; problem
(define (problem new_problem4)
	(:domain progetto)
	(:objects
		c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24 c25 c26 c27 - cell
		t3_1 t3_2 t3_3 - tile_3
		t5_1 t5_2 - tile_5
		t6_1 - tile_6
		t9_1 - tile_9
		ta_1 ta_2 - tile_a
		tb_1 - tile_b
		tc_1 tc_2 - tile_c
		te_1 - tile_e
		d1 d2 d3 - debt
	)
	(:init
		(is_above c1 c4)
		(is_above c2 c5)
		(is_above c3 c6)
		(is_above c4 c7)
		(is_above c5 c8)
		(is_above c6 c9)
		(is_above c7 c10)
		(is_above c8 c11)
		(is_above c9 c12)
		(is_above c10 c13)
		(is_above c11 c14)
		(is_above c12 c15)
		(is_above c13 c16)
		(is_above c14 c17)
		(is_above c15 c18)
		(is_above c16 c19)
		(is_above c17 c20)
		(is_above c18 c21)
		(is_above c19 c22)
		(is_above c20 c23)
		(is_above c21 c24)
		(is_above c22 c25)
		(is_above c23 c26)
		(is_above c24 c27)

		(is_right c2 c1)
		(is_right c3 c2)
		(is_right c5 c4)
		(is_right c6 c5)
		(is_right c8 c7)
		(is_right c9 c8)
		(is_right c11 c10)
		(is_right c12 c11)
		(is_right c14 c13)
		(is_right c15 c14)
		(is_right c17 c16)
		(is_right c18 c17)
		(is_right c20 c19)
		(is_right c21 c20)
		(is_right c23 c22)
		(is_right c24 c23)
		(is_right c26 c25)
		(is_right c27 c26)

		(has_tile c6)
		(open_left c6)
		(open_above c6)
		(open_below c6)
		(open_right c6)

		(has_silver c4)
		(has_silver c11)
		(has_silver c20)

		(has_debt d1)
		(has_debt d2)
		(has_debt d3)

		(= (total-cost) 0)
	)
	(:goal
		(and
			(has_tile c6)
			(has_tile c10)
			(has_tile c21)
			(not (has_debt d1))
			(not (has_debt d2))
			(not (has_debt d3))
		)
	)
	(:metric
		minimize (total-cost)
	)
)

; plan
1. (place_tile_a c9 ta_1)
   added: (has_tile c9) (used ta_1) (open_above c9) (open_left c9)
   goals met: 1 of 6
2. (place_tile_5 c8 t5_1)
   added: (has_tile c8) (used t5_1) (open_below c8) (open_right c8)
   goals met: 1 of 6
3. (place_tile_a c11 ta_2)
   added: (has_tile c11) (used ta_2) (open_above c11) (open_left c11)
   goals met: 1 of 6
4. (place_tile_5 c10 t5_2)
   added: (has_tile c10) (used t5_2) (open_below c10) (open_right c10)
   goals met: 2 of 6
5. (place_tile_c c13 tc_1)
   added: (has_tile c13) (used tc_1) (open_above c13) (open_below c13)
   goals met: 2 of 6
6. (place_tile_9 c16 t9_1)
   added: (has_tile c16) (used t9_1) (open_above c16) (open_right c16)
   goals met: 2 of 6
7. (place_tile_6 c17 t6_1)
   added: (has_tile c17) (used t6_1) (open_below c17) (open_left c17)
   goals met: 2 of 6
8. (place_tile_b c20 tb_1)
   added: (has_tile c20) (used tb_1) (open_left c20) (open_right c20) (open_above c20)
   goals met: 2 of 6
9. (place_tile_3 c21 t3_1)
   added: (has_tile c21) (used t3_1) (open_right c21) (open_left c21)
   goals met: 3 of 6
10. (take_silver c11 d1)
   deleted: (has_silver c11) (has_debt d1)
   added: (started_paying)
   goals met: 4 of 6
11. (take_silver c20 d2)
   deleted: (has_silver c20) (has_debt d2)
   goals met: 5 of 6
12. (pay_debt d3)
   deleted: (has_debt d3)
   goals met: 6 of 6
